results/linux/syscall_high.txt
Running 1m test @ http://localhost:3000/syscall
  8 threads and 500 connections
  Thread calibration: mean lat.: 4162.944ms, rate sampling interval: 15073ms
  Thread calibration: mean lat.: 4215.346ms, rate sampling interval: 15859ms
  Thread calibration: mean lat.: 4415.493ms, rate sampling interval: 16007ms
  Thread calibration: mean lat.: 4421.193ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 3863.792ms, rate sampling interval: 14032ms
  Thread calibration: mean lat.: 4330.825ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 4433.406ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 4381.883ms, rate sampling interval: 15491ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.88s    12.36s    0.89m    57.90%
    Req/Sec   175.83      5.34   188.00     79.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   29.87s 
 75.000%   40.60s 
 90.000%   46.99s 
 99.000%    0.85m 
 99.900%    0.87m 
 99.990%    0.88m 
 99.999%    0.89m 
100.000%    0.89m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7516.159     0.000000            1         1.00
   12812.287     0.100000         7021         1.11
   17055.743     0.200000        14026         1.25
   21315.583     0.300000        21049         1.43
   25542.655     0.400000        28055         1.67
   29868.031     0.500000        35055         2.00
   32047.103     0.550000        38540         2.22
   34177.023     0.600000        42042         2.50
   36274.175     0.650000        45585         2.86
   38404.095     0.700000        49079         3.33
   40599.551     0.750000        52579         4.00
   41615.359     0.775000        54316         4.44
   42729.471     0.800000        56080         5.00
   43810.815     0.825000        57848         5.71
   44859.391     0.850000        59602         6.67
   45940.735     0.875000        61337         8.00
   46465.023     0.887500        62201         8.89
   46989.311     0.900000        63071        10.00
   47546.367     0.912500        63961        11.43
   48070.655     0.925000        64849        13.33
   48594.943     0.937500        65707        16.00
   48857.087     0.943750        66127        17.78
   49184.767     0.950000        66595        20.00
   49414.143     0.956250        67040        22.86
   49676.287     0.962500        67498        26.67
   49938.431     0.968750        67896        32.00
   50102.271     0.971875        68116        35.56
   50266.111     0.975000        68336        40.00
   50397.183     0.978125        68538        45.71
   50561.023     0.981250        68780        53.33
   50724.863     0.984375        68978        64.00
   50823.167     0.985938        69092        71.11
   50954.239     0.987500        69217        80.00
   51085.311     0.989062        69327        91.43
   51183.615     0.990625        69415       106.67
   51347.455     0.992188        69545       128.00
   51412.991     0.992969        69595       142.22
   51478.527     0.993750        69648       160.00
   51544.063     0.994531        69696       182.86
   51609.599     0.995313        69742       213.33
   51707.903     0.996094        69797       256.00
   51773.439     0.996484        69829       284.44
   51838.975     0.996875        69854       320.00
   51904.511     0.997266        69881       365.71
   51970.047     0.997656        69904       426.67
   52101.119     0.998047        69935       512.00
   52133.887     0.998242        69946       568.89
   52199.423     0.998437        69969       640.00
   52232.191     0.998633        69976       731.43
   52297.727     0.998828        69991       853.33
   52363.263     0.999023        70005      1024.00
   52428.799     0.999121        70010      1137.78
   52494.335     0.999219        70015      1280.00
   52559.871     0.999316        70021      1462.86
   52625.407     0.999414        70029      1706.67
   52658.175     0.999512        70034      2048.00
   52690.943     0.999561        70040      2275.56
   52723.711     0.999609        70045      2560.00
   52723.711     0.999658        70045      2925.71
   52789.247     0.999707        70049      3413.33
   52822.015     0.999756        70054      4096.00
   52822.015     0.999780        70054      4551.11
   52854.783     0.999805        70057      5120.00
   52854.783     0.999829        70057      5851.43
   52887.551     0.999854        70059      6826.67
   52920.319     0.999878        70060      8192.00
   52953.087     0.999890        70062      9102.22
   52953.087     0.999902        70062     10240.00
   52985.855     0.999915        70063     11702.86
   52985.855     0.999927        70063     13653.33
   53018.623     0.999939        70064     16384.00
   53051.391     0.999945        70065     18204.44
   53051.391     0.999951        70065     20480.00
   53116.927     0.999957        70066     23405.71
   53116.927     0.999963        70066     27306.67
   53116.927     0.999969        70066     32768.00
   53149.695     0.999973        70067     36408.89
   53149.695     0.999976        70067     40960.00
   53149.695     0.999979        70067     46811.43
   53149.695     0.999982        70067     54613.33
   53149.695     0.999985        70067     65536.00
   53182.463     0.999986        70068     72817.78
   53182.463     1.000000        70068          inf
#[Mean    =    29875.551, StdDeviation   =    12363.824]
#[Max     =    53149.696, Total count    =        70068]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  84430 requests in 1.00m, 12.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 154
Requests/sec:   1406.91
Transfer/sec:    206.09KB