results/linux/syscall_low.txt
Running 1m test @ http://localhost:3000/syscall
  4 threads and 50 connections
  Thread calibration: mean lat.: 1629.120ms, rate sampling interval: 6029ms
  Thread calibration: mean lat.: 1633.743ms, rate sampling interval: 6115ms
  Thread calibration: mean lat.: 1685.572ms, rate sampling interval: 6184ms
  Thread calibration: mean lat.: 1582.514ms, rate sampling interval: 5980ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.97s     5.34s   22.84s    57.65%
    Req/Sec   318.47     12.71   340.00     71.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.66s 
 75.000%   16.66s 
 90.000%   19.51s 
 99.000%   21.63s 
 99.900%   22.48s 
 99.990%   22.82s 
 99.999%   22.86s 
100.000%   22.86s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2779.135     0.000000            1         1.00
    4857.855     0.100000         6383         1.11
    6492.159     0.200000        12741         1.25
    8089.599     0.300000        19119         1.43
    9797.631     0.400000        25509         1.67
   11657.215     0.500000        31864         2.00
   12656.639     0.550000        35032         2.22
   13639.679     0.600000        38246         2.50
   14721.023     0.650000        41411         2.86
   15687.679     0.700000        44591         3.33
   16662.527     0.750000        47776         4.00
   17137.663     0.775000        49409         4.44
   17547.263     0.800000        50962         5.00
   18038.783     0.825000        52555         5.71
   18481.151     0.850000        54153         6.67
   18972.671     0.875000        55763         8.00
   19234.815     0.887500        56559         8.89
   19513.343     0.900000        57328        10.00
   19775.487     0.912500        58133        11.43
   20037.631     0.925000        58915        13.33
   20299.775     0.937500        59769        16.00
   20414.463     0.943750        60130        17.78
   20529.151     0.950000        60523        20.00
   20676.607     0.956250        60943        22.86
   20807.679     0.962500        61309        26.67
   20955.135     0.968750        61721        32.00
   21020.671     0.971875        61920        35.56
   21102.591     0.975000        62127        40.00
   21200.895     0.978125        62323        45.71
   21282.815     0.981250        62494        53.33
   21381.119     0.984375        62695        64.00
   21430.271     0.985938        62799        71.11
   21495.807     0.987500        62904        80.00
   21577.727     0.989062        63005        91.43
   21659.647     0.990625        63107       106.67
   21741.567     0.992188        63193       128.00
   21807.103     0.992969        63248       142.22
   21872.639     0.993750        63300       160.00
   21921.791     0.994531        63340       182.86
   22003.711     0.995313        63400       213.33
   22052.863     0.996094        63443       256.00
   22085.631     0.996484        63471       284.44
   22118.399     0.996875        63491       320.00
   22167.551     0.997266        63518       365.71
   22233.087     0.997656        63540       426.67
   22315.007     0.998047        63565       512.00
   22364.159     0.998242        63577       568.89
   22396.927     0.998437        63589       640.00
   22429.695     0.998633        63602       731.43
   22446.079     0.998828        63614       853.33
   22495.231     0.999023        63628      1024.00
   22544.383     0.999121        63635      1137.78
   22560.767     0.999219        63640      1280.00
   22593.535     0.999316        63654      1462.86
   22593.535     0.999414        63654      1706.67
   22609.919     0.999512        63660      2048.00
   22626.303     0.999561        63664      2275.56
   22626.303     0.999609        63664      2560.00
   22642.687     0.999658        63667      2925.71
   22659.071     0.999707        63670      3413.33
   22708.223     0.999756        63674      4096.00
   22724.607     0.999780        63676      4551.11
   22724.607     0.999805        63676      5120.00
   22790.143     0.999829        63678      5851.43
   22806.527     0.999854        63680      6826.67
   22822.911     0.999878        63684      8192.00
   22822.911     0.999890        63684      9102.22
   22822.911     0.999902        63684     10240.00
   22822.911     0.999915        63684     11702.86
   22822.911     0.999927        63684     13653.33
   22839.295     0.999939        63686     16384.00
   22839.295     0.999945        63686     18204.44
   22839.295     0.999951        63686     20480.00
   22839.295     0.999957        63686     23405.71
   22839.295     0.999963        63686     27306.67
   22855.679     0.999969        63688     32768.00
   22855.679     1.000000        63688          inf
#[Mean    =    11974.810, StdDeviation   =     5338.462]
#[Max     =    22839.296, Total count    =        63688]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  77092 requests in 1.00m, 11.03MB read
Requests/sec:   1284.77
Transfer/sec:    188.20KB